Reports/ВаловаяПрибыльПоПоставщикам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Report>
		<Properties>
			<Name>ВаловаяПрибыльПоПоставщикам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УниверсальныйОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.УниверсальныйОтчет</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/Продажи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>Продажи</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьБезСкидок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьПодразделенияОплатаЗатрат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>12</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументПродажи</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомитентуОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетОРозничныхПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтчетКомиссионераОПродажах</v8:Type>
						<v8:Type>cfg:DocumentRef.РеализацияТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.ПриемТовараНаХранение</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ПродажиСебестоимость.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ПродажиСебестоимость</Name>
			<Comment>(Упр)</Comment>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>СписаниеПартий</Name>
					<Comment>Регламентный документ, сформировавший движения</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвижения</Name>
					<Comment>Документ, к которому относится данное движение</Comment>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументДвиженияПериод</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ХарактеристикаНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаказПокупателя</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаказПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетНаОплатуПокупателю</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДокументОприходования</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслугВНТТ</v8:Type>
						<v8:Type>cfg:DocumentRef.КомплектацияНоменклатуры</v8:Type>
						<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
						<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
						<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

InformationRegisters/ШаблоныЗагрузкиОстатковПоставщиков_СД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>ШаблоныЗагрузкиОстатковПоставщиков_СД</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УчетнаяЗаписьЭлектроннойПочты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтаМенеджера</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерПервойСтроки</Name>
					<Comment>Номер первой строки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерСтраницыЗагрузки</Name>
					<Comment>Номер страницы загрузки</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКолонкиНоменклатура</Name>
					<Comment>Номер колонки номенклатура</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКолонкиКоличество</Name>
					<Comment>Номер колонки количество</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКолонкиЦенаСоСкидкой</Name>
					<Comment>Номер колонки цена</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКолонкиЦенаОпт</Name>
					<Comment>Номер колонки цена со скидкой</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПочтаПоставщика</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НомерКолонкиЦенаРекомендована</Name>
					<Comment>Номер колонки цена рекомендована</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаДоговоров</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ГруппыДоговоров_СД</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ВаловаяПрибыльПоПоставщикам/Ext/ManagerModule.bsl
Функция ПолучитьДляПоставщика(Поставщик, ДоговорПоставщика, НаДату) Экспорт //19.25  
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ВложенныйЗапрос.Организация КАК Организация,
	               |	ВложенныйЗапрос.Проект КАК Проект,
	               |	ВложенныйЗапрос.Подразделение КАК Подразделение,
	               |	ВложенныйЗапрос.Поставщик КАК Поставщик,
	               |	ВложенныйЗапрос.Покупатель КАК Покупатель,
	               |	ВложенныйЗапрос.ДоговорПокупателя КАК ДоговорПокупателя,
	               |	ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	               |	ПолучимНоменклатуруПоставщика.Ссылка КАК НоменклатураПоставщика,
	               |	ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |	ВложенныйЗапрос.ЗаказПокупателя КАК ЗаказПокупателя,
	               |	СУММА(ВложенныйЗапрос.Количество) КАК Количество,
	               |	СУММА(ВложенныйЗапрос.КоличествоЕдиницОтчетов) КАК КоличествоЕдиницОтчетов,
	               |	СУММА(ВложенныйЗапрос.КоличествоБазовыхЕдиниц) КАК КоличествоБазовыхЕдиниц,
	               |	СУММА(ВложенныйЗапрос.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	               |	СУММА(ВложенныйЗапрос.НДС) КАК НДС,
	               |	СУММА(ВложенныйЗапрос.Стоимость) КАК Стоимость,
	               |	СУММА(ВложенныйЗапрос.Себестоимость) КАК Себестоимость,
	               |	СУММА(ВложенныйЗапрос.ВаловаяПрибыль) КАК ВаловаяПрибыль,
	               |	СУММА(ВложенныйЗапрос.Эффективность) КАК Эффективность,
	               |	СУММА(ВложенныйЗапрос.Рентабельность) КАК Рентабельность,
	               |	ВложенныйЗапрос.ДоговорПоставщика,
	               |	ПолучимПочтуПоставщика.ПочтаПоставщика,
	               |	ВложенныйЗапрос.НомерСтроки КАК НомерСтрокиЗаказа
	               |ПОМЕСТИТЬ ВТ_Общ
	               |{ВЫБРАТЬ
	               |	Организация.*,
	               |	Проект.*,
	               |	Подразделение.*,
	               |	Поставщик.*,
	               |	Покупатель.*,
	               |	ДоговорПокупателя.*,
	               |	Номенклатура.*,
	               |	ХарактеристикаНоменклатуры.*,
	               |	ЗаказПокупателя.*,
	               |	Количество,
	               |	КоличествоЕдиницОтчетов,
	               |	КоличествоБазовыхЕдиниц,
	               |	СтоимостьБезНДС,
	               |	НДС,
	               |	Стоимость,
	               |	Себестоимость,
	               |	ВаловаяПрибыль,
	               |	Эффективность,
	               |	Рентабельность}
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		ВложенныйЗапрос.Организация КАК Организация,
	               |		ВложенныйЗапрос.Проект КАК Проект,
	               |		ВложенныйЗапрос.Подразделение КАК Подразделение,
	               |		ВложенныйЗапрос.ДокументОприходования.Контрагент КАК Поставщик,
	               |		ВложенныйЗапрос.Покупатель КАК Покупатель,
	               |		ВложенныйЗапрос.ДоговорПокупателя КАК ДоговорПокупателя,
	               |		ВложенныйЗапрос.Номенклатура КАК Номенклатура,
	               |		ВложенныйЗапрос.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |		ВложенныйЗапрос.ЗаказПокупателя КАК ЗаказПокупателя,
	               |		ВложенныйЗапрос.ДокументОприходования КАК ДокументОприходования,
	               |		ВложенныйЗапрос.Регистратор КАК Регистратор,
	               |		ВложенныйЗапрос.Период КАК Период,
	               |		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ДЕНЬ) КАК ПериодДень,
	               |		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, НЕДЕЛЯ) КАК ПериодНеделя,
	               |		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ДЕКАДА) КАК ПериодДекада,
	               |		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, МЕСЯЦ) КАК ПериодМесяц,
	               |		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, КВАРТАЛ) КАК ПериодКвартал,
	               |		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ПОЛУГОДИЕ) КАК ПериодПолугодие,
	               |		НАЧАЛОПЕРИОДА(ВложенныйЗапрос.Период, ГОД) КАК ПериодГод,
	               |		СУММА(ВложенныйЗапрос.Количество) КАК Количество,
	               |		СУММА(ВложенныйЗапрос.КоличествоЕдиницОтчетов) КАК КоличествоЕдиницОтчетов,
	               |		СУММА(ВложенныйЗапрос.КоличествоБазовыхЕдиниц) КАК КоличествоБазовыхЕдиниц,
	               |		СУММА(ВЫБОР
	               |				КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	               |					ТОГДА ВложенныйЗапрос.СтоимостьБезНДС
	               |				ИНАЧЕ ВложенныйЗапрос.СтоимостьБезНДС * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	               |			КОНЕЦ) КАК СтоимостьБезНДС,
	               |		СУММА(ВЫБОР
	               |				КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	               |					ТОГДА ВложенныйЗапрос.НДС
	               |				ИНАЧЕ ВложенныйЗапрос.НДС * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	               |			КОНЕЦ) КАК НДС,
	               |		СУММА(ВЫБОР
	               |				КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	               |					ТОГДА ВложенныйЗапрос.Стоимость
	               |				ИНАЧЕ ВложенныйЗапрос.Стоимость * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	               |			КОНЕЦ) КАК Стоимость,
	               |		СУММА(ВложенныйЗапрос.Себестоимость) КАК Себестоимость,
	               |		ВЫБОР
	               |			КОГДА &НеВключатьНДСВСтоимостьПартий
	               |				ТОГДА СУММА(ВЫБОР
	               |							КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	               |								ТОГДА ВложенныйЗапрос.СтоимостьБезНДС
	               |							ИНАЧЕ ВложенныйЗапрос.СтоимостьБезНДС * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	               |						КОНЕЦ)
	               |			ИНАЧЕ СУММА(ВЫБОР
	               |						КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	               |							ТОГДА ВложенныйЗапрос.Стоимость
	               |						ИНАЧЕ ВложенныйЗапрос.Стоимость * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	               |					КОНЕЦ)
	               |		КОНЕЦ - СУММА(ВложенныйЗапрос.Себестоимость) КАК ВаловаяПрибыль,
	               |		100 * ВЫБОР
	               |			КОГДА &НеВключатьНДСВСтоимостьПартий
	               |				ТОГДА ВЫБОР
	               |						КОГДА СУММА(ВложенныйЗапрос.Себестоимость) > 0
	               |							ТОГДА (СУММА(ВЫБОР
	               |										КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	               |											ТОГДА ВложенныйЗапрос.СтоимостьБезНДС
	               |										ИНАЧЕ ВложенныйЗапрос.СтоимостьБезНДС * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	               |									КОНЕЦ) - СУММА(ВложенныйЗапрос.Себестоимость)) / СУММА(ВложенныйЗапрос.Себестоимость)
	               |						ИНАЧЕ 0
	               |					КОНЕЦ
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА СУММА(ВложенныйЗапрос.Себестоимость) > 0
	               |						ТОГДА (СУММА(ВЫБОР
	               |									КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	               |										ТОГДА ВложенныйЗапрос.Стоимость
	               |									ИНАЧЕ ВложенныйЗапрос.Стоимость * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	               |								КОНЕЦ) - СУММА(ВложенныйЗапрос.Себестоимость)) / СУММА(ВложенныйЗапрос.Себестоимость)
	               |					ИНАЧЕ 0
	               |				КОНЕЦ
	               |		КОНЕЦ КАК Эффективность,
	               |		100 * ВЫБОР
	               |			КОГДА &НеВключатьНДСВСтоимостьПартий
	               |				ТОГДА ВЫБОР
	               |						КОГДА СУММА(ВЫБОР
	               |									КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	               |										ТОГДА ВложенныйЗапрос.СтоимостьБезНДС
	               |									ИНАЧЕ ВложенныйЗапрос.СтоимостьБезНДС * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	               |								КОНЕЦ) > 0
	               |							ТОГДА (СУММА(ВЫБОР
	               |										КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	               |											ТОГДА ВложенныйЗапрос.СтоимостьБезНДС
	               |										ИНАЧЕ ВложенныйЗапрос.СтоимостьБезНДС * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	               |									КОНЕЦ) - СУММА(ВложенныйЗапрос.Себестоимость)) / СУММА(ВЫБОР
	               |										КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	               |											ТОГДА ВложенныйЗапрос.СтоимостьБезНДС
	               |										ИНАЧЕ ВложенныйЗапрос.СтоимостьБезНДС * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	               |									КОНЕЦ)
	               |						ИНАЧЕ 0
	               |					КОНЕЦ
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА СУММА(ВЫБОР
	               |								КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	               |									ТОГДА ВложенныйЗапрос.Стоимость
	               |								ИНАЧЕ ВложенныйЗапрос.Стоимость * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	               |							КОНЕЦ) > 0
	               |						ТОГДА (СУММА(ВЫБОР
	               |									КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	               |										ТОГДА ВложенныйЗапрос.Стоимость
	               |									ИНАЧЕ ВложенныйЗапрос.Стоимость * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	               |								КОНЕЦ) - СУММА(ВложенныйЗапрос.Себестоимость)) / СУММА(ВЫБОР
	               |									КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	               |										ТОГДА ВложенныйЗапрос.Стоимость
	               |									ИНАЧЕ ВложенныйЗапрос.Стоимость * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	               |								КОНЕЦ)
	               |					ИНАЧЕ 0
	               |				КОНЕЦ
	               |		КОНЕЦ КАК Рентабельность,
	               |		ВложенныйЗапрос.ДокументОприходования.ДоговорКонтрагента КАК ДоговорПоставщика,
	               |		ВложенныйЗапрос.НомерСтроки КАК НомерСтроки
	               |	{ВЫБРАТЬ
	               |		Организация,
	               |		Проект,
	               |		Подразделение,
	               |		Поставщик,
	               |		Покупатель,
	               |		ДоговорПокупателя,
	               |		Номенклатура,
	               |		ХарактеристикаНоменклатуры,
	               |		ЗаказПокупателя,
	               |		ДокументОприходования,
	               |		Регистратор,
	               |		Период,
	               |		ПериодДень,
	               |		ПериодНеделя,
	               |		ПериодДекада,
	               |		ПериодМесяц,
	               |		ПериодКвартал,
	               |		ПериодПолугодие,
	               |		ПериодГод}
	               |	ИЗ
	               |		(ВЫБРАТЬ
	               |			ПродажиОбороты.Организация КАК Организация,
	               |			ПродажиОбороты.Проект КАК Проект,
	               |			ПродажиОбороты.Подразделение КАК Подразделение,
	               |			ПродажиОбороты.Контрагент КАК Покупатель,
	               |			ПродажиОбороты.ДоговорКонтрагента КАК ДоговорПокупателя,
	               |			ПродажиОбороты.Номенклатура КАК Номенклатура,
	               |			ПродажиОбороты.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |			ПродажиОбороты.ЗаказПокупателя КАК ЗаказПокупателя,
	               |			ТаблицаРегистраПродажиСебестоимость.ДокументОприходования КАК ДокументОприходования,
	               |			ПродажиОбороты.Регистратор КАК Регистратор,
	               |			ПродажиОбороты.Период КАК Период,
	               |			ПродажиОбороты.КоличествоОборот КАК КоличествоПродажи,
	               |			ТаблицаРегистраПродажиСебестоимость.Количество КАК Количество,
	               |			ТаблицаРегистраПродажиСебестоимость.Количество * ЕСТЬNULL(ПродажиОбороты.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент, 1) / ЕСТЬNULL(ПродажиОбороты.Номенклатура.ЕдиницаДляОтчетов.Коэффициент, 1) КАК КоличествоЕдиницОтчетов,
	               |			ТаблицаРегистраПродажиСебестоимость.Количество * ЕСТЬNULL(ПродажиОбороты.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент, 1) КАК КоличествоБазовыхЕдиниц,
	               |			ПродажиОбороты.СтоимостьОборот - ПродажиОбороты.НДСОборот КАК СтоимостьБезНДС,
	               |			ПродажиОбороты.НДСОборот КАК НДС,
	               |			ПродажиОбороты.СтоимостьОборот КАК Стоимость,
	               |			ТаблицаРегистраПродажиСебестоимость.СтоимостьОборот КАК Себестоимость,
	               |			ТаблицаРегистраПродажиСебестоимость.НомерСтроки КАК НомерСтроки
	               |		ИЗ
	               |			РегистрНакопления.Продажи.Обороты(&ДатаНач, &ДатаКон, Регистратор, {(Организация).* КАК Организация, (Проект).* КАК Проект, (Подразделение).* КАК Подразделение, (Контрагент).* КАК Покупатель, (ДоговорКонтрагента).* КАК ДоговорПокупателя, (Номенклатура).* КАК Номенклатура, (ХарактеристикаНоменклатуры).* КАК ХарактеристикаНоменклатуры, (ЗаказПокупателя).* КАК ЗаказПокупателя}) КАК ПродажиОбороты
	               |				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |					ПродажиСебестоимость.Номенклатура КАК Номенклатура,
	               |					ПродажиСебестоимость.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |					ПродажиСебестоимость.ЗаказПокупателя КАК ЗаказПокупателя,
	               |					ПродажиСебестоимость.ДокументОприходования КАК ДокументОприходования,
	               |					ВЫБОР
	               |						КОГДА ПродажиСебестоимость.ДокументДвижения <> НЕОПРЕДЕЛЕНО
	               |							ТОГДА ПродажиСебестоимость.ДокументДвижения
	               |						ИНАЧЕ ПродажиСебестоимость.Регистратор
	               |					КОНЕЦ КАК Регистратор,
	               |					СУММА(ПродажиСебестоимость.Количество) КАК Количество,
	               |					СУММА(ПродажиСебестоимость.Стоимость) КАК СтоимостьОборот,
	               |					ПродажиСебестоимость.НомерСтроки КАК НомерСтроки
	               |				ИЗ
	               |					РегистрНакопления.ПродажиСебестоимость КАК ПродажиСебестоимость
	               |				ГДЕ
	               |					ПродажиСебестоимость.Период МЕЖДУ &ДатаНачала И &ДатаКонца
	               |				{ГДЕ
	               |					ПродажиСебестоимость.Проект.* КАК Проект,
	               |					ПродажиСебестоимость.Подразделение.* КАК Подразделение,
	               |					ПродажиСебестоимость.ДокументОприходования.* КАК ДокументОприходования,
	               |					ПродажиСебестоимость.ДокументОприходования.Контрагент.* КАК Поставщик,
	               |					ПродажиСебестоимость.Номенклатура.* КАК Номенклатура,
	               |					ПродажиСебестоимость.ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры,
	               |					ПродажиСебестоимость.ЗаказПокупателя.* КАК ЗаказПокупателя}
	               |				
	               |				СГРУППИРОВАТЬ ПО
	               |					ПродажиСебестоимость.Номенклатура,
	               |					ПродажиСебестоимость.ХарактеристикаНоменклатуры,
	               |					ПродажиСебестоимость.ЗаказПокупателя,
	               |					ПродажиСебестоимость.ДокументОприходования,
	               |					ВЫБОР
	               |						КОГДА ПродажиСебестоимость.ДокументДвижения <> НЕОПРЕДЕЛЕНО
	               |							ТОГДА ПродажиСебестоимость.ДокументДвижения
	               |						ИНАЧЕ ПродажиСебестоимость.Регистратор
	               |					КОНЕЦ,
	               |					ПродажиСебестоимость.НомерСтроки) КАК ТаблицаРегистраПродажиСебестоимость
	               |				ПО (ТаблицаРегистраПродажиСебестоимость.Номенклатура = ПродажиОбороты.Номенклатура)
	               |					И (ТаблицаРегистраПродажиСебестоимость.ХарактеристикаНоменклатуры = ПродажиОбороты.ХарактеристикаНоменклатуры)
	               |					И (ТаблицаРегистраПродажиСебестоимость.ЗаказПокупателя = ПродажиОбороты.ЗаказПокупателя)
	               |					И (ТаблицаРегистраПродажиСебестоимость.Регистратор = ПродажиОбороты.Регистратор)
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			ПродажиОбороты.Организация,
	               |			ПродажиОбороты.Проект,
	               |			ПродажиОбороты.Подразделение,
	               |			ПродажиОбороты.Контрагент,
	               |			ПродажиОбороты.ДоговорКонтрагента,
	               |			ПродажиОбороты.Номенклатура,
	               |			ПродажиОбороты.ХарактеристикаНоменклатуры,
	               |			ПродажиОбороты.ЗаказПокупателя,
	               |			НЕОПРЕДЕЛЕНО,
	               |			ПродажиОбороты.Регистратор,
	               |			ПродажиОбороты.Период,
	               |			ПродажиОбороты.КоличествоОборот,
	               |			ПродажиОбороты.КоличествоОборот - ЕСТЬNULL(ТаблицаРегистраПродажиСебестоимость.Количество, 0),
	               |			(ПродажиОбороты.КоличествоОборот - ЕСТЬNULL(ТаблицаРегистраПродажиСебестоимость.Количество, 0)) * ЕСТЬNULL(ПродажиОбороты.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент, 1) / ЕСТЬNULL(ПродажиОбороты.Номенклатура.ЕдиницаДляОтчетов.Коэффициент, 1),
	               |			(ПродажиОбороты.КоличествоОборот - ЕСТЬNULL(ТаблицаРегистраПродажиСебестоимость.Количество, 0)) * ЕСТЬNULL(ПродажиОбороты.Номенклатура.ЕдиницаХраненияОстатков.Коэффициент, 1),
	               |			ПродажиОбороты.СтоимостьОборот - ПродажиОбороты.НДСОборот,
	               |			ПродажиОбороты.НДСОборот,
	               |			ПродажиОбороты.СтоимостьОборот,
	               |			0,
	               |			NULL
	               |		ИЗ
	               |			РегистрНакопления.Продажи.Обороты(&ДатаНач, &ДатаКон, Регистратор, {(Организация).* КАК Организация, (Проект).* КАК Проект, (Подразделение).* КАК Подразделение, (Контрагент).* КАК Покупатель, (ДоговорКонтрагента).* КАК ДоговорПокупателя, (Номенклатура).* КАК Номенклатура, (ХарактеристикаНоменклатуры).* КАК ХарактеристикаНоменклатуры, (ЗаказПокупателя).* КАК ЗаказПокупателя}) КАК ПродажиОбороты
	               |				ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |					ПродажиСебестоимость.Номенклатура КАК Номенклатура,
	               |					ПродажиСебестоимость.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |					ПродажиСебестоимость.ЗаказПокупателя КАК ЗаказПокупателя,
	               |					ВЫБОР
	               |						КОГДА ПродажиСебестоимость.ДокументДвижения <> НЕОПРЕДЕЛЕНО
	               |							ТОГДА ПродажиСебестоимость.ДокументДвижения
	               |						ИНАЧЕ ПродажиСебестоимость.Регистратор
	               |					КОНЕЦ КАК Регистратор,
	               |					СУММА(ПродажиСебестоимость.Количество) КАК Количество,
	               |					СУММА(ПродажиСебестоимость.Стоимость) КАК СтоимостьОборот
	               |				ИЗ
	               |					РегистрНакопления.ПродажиСебестоимость КАК ПродажиСебестоимость
	               |				ГДЕ
	               |					ПродажиСебестоимость.Период МЕЖДУ &ДатаНачала И &ДатаКонца
	               |				{ГДЕ
	               |					ПродажиСебестоимость.Проект.* КАК Проект,
	               |					ПродажиСебестоимость.Подразделение.* КАК Подразделение,
	               |					ПродажиСебестоимость.ДокументОприходования.* КАК ДокументОприходования,
	               |					ПродажиСебестоимость.ДокументОприходования.Контрагент.* КАК Поставщик,
	               |					ПродажиСебестоимость.Номенклатура.* КАК Номенклатура,
	               |					ПродажиСебестоимость.ХарактеристикаНоменклатуры.* КАК ХарактеристикаНоменклатуры,
	               |					ПродажиСебестоимость.ЗаказПокупателя.* КАК ЗаказПокупателя}
	               |				
	               |				СГРУППИРОВАТЬ ПО
	               |					ПродажиСебестоимость.Номенклатура,
	               |					ПродажиСебестоимость.ХарактеристикаНоменклатуры,
	               |					ПродажиСебестоимость.ЗаказПокупателя,
	               |					ВЫБОР
	               |						КОГДА ПродажиСебестоимость.ДокументДвижения <> НЕОПРЕДЕЛЕНО
	               |							ТОГДА ПродажиСебестоимость.ДокументДвижения
	               |						ИНАЧЕ ПродажиСебестоимость.Регистратор
	               |					КОНЕЦ) КАК ТаблицаРегистраПродажиСебестоимость
	               |				ПО (ТаблицаРегистраПродажиСебестоимость.Номенклатура = ПродажиОбороты.Номенклатура)
	               |					И (ТаблицаРегистраПродажиСебестоимость.ХарактеристикаНоменклатуры = ПродажиОбороты.ХарактеристикаНоменклатуры)
	               |					И (ТаблицаРегистраПродажиСебестоимость.ЗаказПокупателя = ПродажиОбороты.ЗаказПокупателя)
	               |					И (ТаблицаРегистраПродажиСебестоимость.Регистратор = ПродажиОбороты.Регистратор)) КАК ВложенныйЗапрос
	               |	
	               |	СГРУППИРОВАТЬ ПО
	               |		ВложенныйЗапрос.Организация,
	               |		ВложенныйЗапрос.Проект,
	               |		ВложенныйЗапрос.Подразделение,
	               |		ВложенныйЗапрос.ДокументОприходования.Контрагент,
	               |		ВложенныйЗапрос.Покупатель,
	               |		ВложенныйЗапрос.ДоговорПокупателя,
	               |		ВложенныйЗапрос.Номенклатура,
	               |		ВложенныйЗапрос.ХарактеристикаНоменклатуры,
	               |		ВложенныйЗапрос.ЗаказПокупателя,
	               |		ВложенныйЗапрос.ДокументОприходования,
	               |		ВложенныйЗапрос.Регистратор,
	               |		ВложенныйЗапрос.Период,
	               |		ВложенныйЗапрос.ДокументОприходования.ДоговорКонтрагента,
	               |		ВложенныйЗапрос.НомерСтроки
	               |	
	               |	ИМЕЮЩИЕ
	               |		(СУММА(ВложенныйЗапрос.Количество) <> 0
	               |			ИЛИ СУММА(ВложенныйЗапрос.Себестоимость) <> 0
	               |			ИЛИ СУММА(ВЫБОР
	               |					КОГДА ВложенныйЗапрос.КоличествоПродажи = 0
	               |						ТОГДА ВложенныйЗапрос.Стоимость
	               |					ИНАЧЕ ВложенныйЗапрос.Стоимость * ВложенныйЗапрос.Количество / ВложенныйЗапрос.КоличествоПродажи
	               |				КОНЕЦ) <> 0)) КАК ВложенныйЗапрос
	               |		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			МАКСИМУМ(НоменклатураПоставщика.Ссылка) КАК Ссылка,
	               |			НоменклатураПоставщика.Номенклатура КАК Номенклатура,
	               |			НоменклатураПоставщика.Владелец КАК Владелец
	               |		ИЗ
	               |			Справочник.НоменклатураПоставщика КАК НоменклатураПоставщика
	               |		
	               |		СГРУППИРОВАТЬ ПО
	               |			НоменклатураПоставщика.Владелец,
	               |			НоменклатураПоставщика.Номенклатура) КАК ПолучимНоменклатуруПоставщика
	               |		ПО ВложенныйЗапрос.Поставщик = ПолучимНоменклатуруПоставщика.Владелец
	               |			И ВложенныйЗапрос.Номенклатура = ПолучимНоменклатуруПоставщика.Номенклатура
	               |		ПОЛНОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ШаблоныЗагрузкиОстатковПоставщиков_СДСрезПоследних.ПочтаПоставщика КАК ПочтаПоставщика,
	               |			ШаблоныЗагрузкиОстатковПоставщиков_СДСрезПоследних.Поставщик КАК Поставщик
	               |		ИЗ
	               |			РегистрСведений.ШаблоныЗагрузкиОстатковПоставщиков_СД.СрезПоследних КАК ШаблоныЗагрузкиОстатковПоставщиков_СДСрезПоследних) КАК ПолучимПочтуПоставщика
	               |		ПО ВложенныйЗапрос.Поставщик = ПолучимПочтуПоставщика.Поставщик
	               |ГДЕ
	               |	ВложенныйЗапрос.Поставщик = &Поставщик
	               |	И ВложенныйЗапрос.ДоговорПоставщика.БП_ТипДоговора.Код = ""000000004""
	               |	И ВложенныйЗапрос.ДоговорПоставщика = &ДоговорПоставщика
	               |{ГДЕ
	               |	ВложенныйЗапрос.ДокументОприходования.* КАК ДокументОприходования,
	               |	ВложенныйЗапрос.Поставщик.* КАК Поставщик,
	               |	ВложенныйЗапрос.Регистратор.*,
	               |	ВложенныйЗапрос.Период,
	               |	ВложенныйЗапрос.ПериодДень,
	               |	ВложенныйЗапрос.ПериодНеделя,
	               |	ВложенныйЗапрос.ПериодДекада,
	               |	ВложенныйЗапрос.ПериодМесяц,
	               |	ВложенныйЗапрос.ПериодКвартал,
	               |	ВложенныйЗапрос.ПериодПолугодие,
	               |	ВложенныйЗапрос.ПериодГод,
	               |	ВложенныйЗапрос.Количество,
	               |	ВложенныйЗапрос.КоличествоЕдиницОтчетов,
	               |	ВложенныйЗапрос.КоличествоБазовыхЕдиниц,
	               |	ВложенныйЗапрос.СтоимостьБезНДС,
	               |	ВложенныйЗапрос.НДС,
	               |	ВложенныйЗапрос.Стоимость,
	               |	ВложенныйЗапрос.Себестоимость,
	               |	ВложенныйЗапрос.ВаловаяПрибыль,
	               |	ВложенныйЗапрос.Эффективность,
	               |	ВложенныйЗапрос.Рентабельность}
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Организация,
	               |	ВложенныйЗапрос.ХарактеристикаНоменклатуры,
	               |	ВложенныйЗапрос.Подразделение,
	               |	ВложенныйЗапрос.ЗаказПокупателя,
	               |	ВложенныйЗапрос.Номенклатура,
	               |	ВложенныйЗапрос.ДоговорПокупателя,
	               |	ПолучимПочтуПоставщика.ПочтаПоставщика,
	               |	ВложенныйЗапрос.Проект,
	               |	ВложенныйЗапрос.ДоговорПоставщика,
	               |	ВложенныйЗапрос.Поставщик,
	               |	ВложенныйЗапрос.Покупатель,
	               |	ПолучимНоменклатуруПоставщика.Ссылка,
	               |	ВложенныйЗапрос.НомерСтроки
	               |{УПОРЯДОЧИТЬ ПО
	               |	Организация.*,
	               |	Проект.*,
	               |	Подразделение.*,
	               |	Поставщик.*,
	               |	Покупатель.*,
	               |	ДоговорПокупателя.*,
	               |	Номенклатура.*,
	               |	ХарактеристикаНоменклатуры.*,
	               |	ЗаказПокупателя.*,
	               |	Количество,
	               |	КоличествоЕдиницОтчетов,
	               |	КоличествоБазовыхЕдиниц,
	               |	СтоимостьБезНДС,
	               |	НДС,
	               |	Стоимость,
	               |	Себестоимость,
	               |	ВаловаяПрибыль,
	               |	Эффективность,
	               |	Рентабельность}
	               |{ИТОГИ ПО
	               |	Организация.*,
	               |	Проект.*,
	               |	Подразделение.*,
	               |	Поставщик.*,
	               |	Покупатель.*,
	               |	ДоговорПокупателя.*,
	               |	Номенклатура.*,
	               |	ХарактеристикаНоменклатуры.*,
	               |	ЗаказПокупателя.*}
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Общ.Организация,
	               |	ВТ_Общ.Проект,
	               |	ВТ_Общ.Подразделение,
	               |	ВТ_Общ.Поставщик,
	               |	ВТ_Общ.Покупатель,
	               |	ВТ_Общ.ДоговорПокупателя,
	               |	ВТ_Общ.Номенклатура,
	               |	ВТ_Общ.НоменклатураПоставщика,
	               |	ВТ_Общ.ХарактеристикаНоменклатуры,
	               |	ВТ_Общ.ЗаказПокупателя,
	               |	СУММА(ВТ_Общ.Количество) КАК Количество,
	               |	СУММА(ВТ_Общ.КоличествоЕдиницОтчетов) КАК КоличествоЕдиницОтчетов,
	               |	СУММА(ВТ_Общ.КоличествоБазовыхЕдиниц) КАК КоличествоБазовыхЕдиниц,
	               |	СУММА(ВТ_Общ.СтоимостьБезНДС) КАК СтоимостьБезНДС,
	               |	СУММА(ВТ_Общ.НДС) КАК НДС,
	               |	СУММА(ВТ_Общ.Стоимость) КАК Стоимость,
	               |	СУММА(ВТ_Общ.Себестоимость) КАК Себестоимость,
	               |	СУММА(ВТ_Общ.ВаловаяПрибыль) КАК ВаловаяПрибыль,
	               |	СУММА(ВТ_Общ.Эффективность) КАК Эффективность,
	               |	СУММА(ВТ_Общ.Рентабельность) КАК Рентабельность,
	               |	ВТ_Общ.ДоговорПоставщика,
	               |	ВТ_Общ.ПочтаПоставщика
	               |ИЗ
	               |	ВТ_Общ КАК ВТ_Общ
	               |ГДЕ
	               |	ВТ_Общ.Количество <> 0
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Общ.Подразделение,
	               |	ВТ_Общ.Поставщик,
	               |	ВТ_Общ.НоменклатураПоставщика,
	               |	ВТ_Общ.Покупатель,
	               |	ВТ_Общ.Организация,
	               |	ВТ_Общ.ХарактеристикаНоменклатуры,
	               |	ВТ_Общ.ЗаказПокупателя,
	               |	ВТ_Общ.ДоговорПоставщика,
	               |	ВТ_Общ.ПочтаПоставщика,
	               |	ВТ_Общ.Проект,
	               |	ВТ_Общ.Номенклатура,
	               |	ВТ_Общ.ДоговорПокупателя"; 
	                                                                    
		
		Запрос.УстановитьПараметр("ДатаНач", ?(НаДату = Дата('00010101000000'), НаДату, Новый Граница(НачалоДня(НаДату), ВидГраницы.Включая)));
		Запрос.УстановитьПараметр("ДатаКон", ?(НаДату = Дата('00010101000000'), НаДату, Новый Граница(КонецДня(НаДату), ВидГраницы.Включая)));
		Запрос.УстановитьПараметр("ДатаНачала", ?(НаДату = Дата('00010101000000'), НаДату, НачалоДня(НаДату)));
		Запрос.УстановитьПараметр("ДатаКонца", ?(НаДату = Дата('00010101000000'), Дата("39991231"), КонецДня(НаДату))); 
		
		Запрос.УстановитьПараметр("Поставщик", Поставщик);  
		Запрос.УстановитьПараметр("ДоговорПоставщика", ДоговорПоставщика);
		
		Запрос.УстановитьПараметр("НеВключатьНДСВСтоимостьПартий", Ложь);

                 
		

	 Возврат  Запрос.Выполнить().Выгрузить();
	  	
	
КонецФункции
